Revit 2024 API
ExportDWGSettings.SetDWGExportOptions Method
 Sets the options stored in these settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetDWGExportOptions(
	DWGExportOptions options
)
Visual Basic
Public Sub SetDWGExportOptions ( _
	options As DWGExportOptions _
)
Visual C++
public:
void SetDWGExportOptions(
	DWGExportOptions^ options
)
Parameters
options
Type: Autodesk.Revit.DB.DWGExportOptions
 The options.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportDWGSettings Class
Autodesk.Revit.DB Namespace